<a href="https://colab.research.google.com/github/muzhiyaojing/PandasExercise/blob/master/02_Filtering_Sorting_Ex3_Chipotle.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [0]:
chipo = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv',sep='\t')
chipo.head(5)

   order_id  ...  item_price
0         1  ...      $2.39
1         1  ...      $3.39
2         1  ...      $3.39
3         1  ...      $2.39
4         2  ...     $16.98

[5 rows x 5 columns]

In [0]:
chipo[['item_name','item_price']].drop_duplicates().sort_values('item_name').head(1)

              item_name item_price
3389  6 Pack Soft Drink    $12.98

In [0]:
#updateDataType = lambda x: float(x[1:])

#chipo['item_price']=chipo['item_price'].apply(updateDataType)

chipo.sort_values('item_price',ascending=False).head(1)

      order_id  quantity  ... choice_description item_price
3598      1443        15  ...                NaN      44.25

[1 rows x 5 columns]

In [0]:
chipo[chipo['item_name']=='Veggie Salad Bowl'].count()

order_id              18
quantity              18
item_name             18
choice_description    18
item_price            18
dtype: int64